//8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
//Сперва выполнил через str_split, но данная функция работала только на латинице, потом в интернете нашел решение этой проблемы и выполнил задание через preg_split

<?php

$towns = array(
	"Московская область"=>array("Москва", "Зеленоград", "Клин"),
	"Ленинградская область"=>array("Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"),
	"Рязанская область"=>array("Рязань", "Косимов", "Скопин", "Шацк"));
	
foreach($towns as $obl => $name)
{
	echo "<h3>$obl</h3>";
	echo "<ul>";
	foreach($name as $key => $value)
	{
		$str = preg_split('//u', $value, -1, PREG_SPLIT_NO_EMPTY);
		//print_r($str);	
		foreach($str as $i => $letter)
		{
		    if($letter == "К")
		    {
		        echo "<li>$value</li>";
		    }
		}
	}
	echo "</ul>";
}

?>