//9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания

<?php

function Translate($word)
{
	$letters = array(
	"а"=>"a",
	"б"=>"b",
	"в"=>"v",
	"г"=>"g",
	"д"=>"d",
	"е"=>"e",
	"ё"=>"e",
	"ж"=>"zh",
	"з"=>"z",
	"и"=>"i",
	"й"=>"i",
	"к"=>"k",
	"л"=>"l",
	"м"=>"m",
	"н"=>"n",
	"о"=>"o",
	"п"=>"p",
	"р"=>"r",
	"с"=>"s",
	"т"=>"t",
	"у"=>"y",
	"ф"=>"f",
	"х"=>"h",
	"ц"=>"c",
	"ч"=>"ch",
	"ш"=>"sch",
	"щ"=>"sch",
	"ь"=>" ",
	"ы"=>"i",
	"ъ"=>" ",
	"э"=>"e",
	"ю"=>"u",
	"я"=>"ya",
	" "=>"_"
);
	
    echo strtr($word, $letters);
}

Translate("привет как дела");

?>